Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33f/h/p33FJ128MC706.h
#define DTCON2 DTCON2
extern volatile unsigned int  DTCON2 __attribute__((__sfr__));
typedef struct tagDTCON2BITS {
  unsigned DTS1I:1;
  unsigned DTS1A:1;
  unsigned DTS2I:1;
  unsigned DTS2A:1;
  unsigned DTS3I:1;
  unsigned DTS3A:1;
  unsigned DTS4I:1;
  unsigned DTS4A:1;
} DTCON2BITS;
extern volatile DTCON2BITS DTCON2bits __attribute__((__sfr__));

#define P1DTCON2 P1DTCON2
extern volatile unsigned int  P1DTCON2 __attribute__((__sfr__));
typedef struct tagP1DTCON2BITS {
  unsigned DTS1I:1;
  unsigned DTS1A:1;
  unsigned DTS2I:1;
  unsigned DTS2A:1;
  unsigned DTS3I:1;
  unsigned DTS3A:1;
  unsigned DTS4I:1;
  unsigned DTS4A:1;
} P1DTCON2BITS;
extern volatile P1DTCON2BITS P1DTCON2bits __attribute__((__sfr__));

#define FLTACON FLTACON
extern volatile unsigned int  FLTACON __attribute__((__sfr__));
typedef struct tagFLTACONBITS {
  unsigned FAEN1:1;
  unsigned FAEN2:1;
  unsigned FAEN3:1;
  unsigned FAEN4:1;
  unsigned :3;
  unsigned FLTAM:1;
  unsigned FAOV1L:1;
  unsigned FAOV1H:1;
  unsigned FAOV2L:1;
  unsigned FAOV2H:1;
  unsigned FAOV3L:1;
  unsigned FAOV3H:1;
  unsigned FAOV4L:1;
  unsigned FAOV4H:1;
} FLTACONBITS;
extern volatile FLTACONBITS FLTACONbits __attribute__((__sfr__));

#define P1FLTACON P1FLTACON
extern volatile unsigned int  P1FLTACON __attribute__((__sfr__));
typedef struct tagP1FLTACONBITS {
  unsigned FAEN1:1;
  unsigned FAEN2:1;
  unsigned FAEN3:1;
  unsigned FAEN4:1;
  unsigned :3;
  unsigned FLTAM:1;
  unsigned FAOV1L:1;
  unsigned FAOV1H:1;
  unsigned FAOV2L:1;
  unsigned FAOV2H:1;
  unsigned FAOV3L:1;
  unsigned FAOV3H:1;
  unsigned FAOV4L:1;
  unsigned FAOV4H:1;
} P1FLTACONBITS;
extern volatile P1FLTACONBITS P1FLTACONbits __attribute__((__sfr__));

#define FLTBCON FLTBCON
extern volatile unsigned int  FLTBCON __attribute__((__sfr__));
typedef struct tagFLTBCONBITS {
  unsigned FBEN1:1;
  unsigned FBEN2:1;
  unsigned FBEN3:1;
  unsigned FBEN4:1;
  unsigned :3;
  unsigned FLTBM:1;
  unsigned FBOV1L:1;
  unsigned FBOV1H:1;
  unsigned FBOV2L:1;
  unsigned FBOV2H:1;
  unsigned FBOV3L:1;
  unsigned FBOV3H:1;
  unsigned FBOV4L:1;
  unsigned FBOV4H:1;
} FLTBCONBITS;
extern volatile FLTBCONBITS FLTBCONbits __attribute__((__sfr__));

#define P1FLTBCON P1FLTBCON
extern volatile unsigned int  P1FLTBCON __attribute__((__sfr__));
typedef struct tagP1FLTBCONBITS {
  unsigned FBEN1:1;
  unsigned FBEN2:1;
  unsigned FBEN3:1;
  unsigned FBEN4:1;
  unsigned :3;
  unsigned FLTBM:1;
  unsigned FBOV1L:1;
  unsigned FBOV1H:1;
  unsigned FBOV2L:1;
  unsigned FBOV2H:1;
  unsigned FBOV3L:1;
  unsigned FBOV3H:1;
  unsigned FBOV4L:1;
  unsigned FBOV4H:1;
} P1FLTBCONBITS;
extern volatile P1FLTBCONBITS P1FLTBCONbits __attribute__((__sfr__));

#define OVDCON OVDCON
extern volatile unsigned int  OVDCON __attribute__((__sfr__));
typedef struct tagOVDCONBITS {
  unsigned POUT1L:1;
  unsigned POUT1H:1;
  unsigned POUT2L:1;
  unsigned POUT2H:1;
  unsigned POUT3L:1;
  unsigned POUT3H:1;
  unsigned POUT4L:1;
  unsigned POUT4H:1;
  unsigned POVD1L:1;
  unsigned POVD1H:1;
  unsigned POVD2L:1;
  unsigned POVD2H:1;
  unsigned POVD3L:1;
  unsigned POVD3H:1;
  unsigned POVD4L:1;
  unsigned POVD4H:1;
} OVDCONBITS;
extern volatile OVDCONBITS OVDCONbits __attribute__((__sfr__));

#define P1OVDCON P1OVDCON
extern volatile unsigned int  P1OVDCON __attribute__((__sfr__));
typedef struct tagP1OVDCONBITS {
  unsigned POUT1L:1;
  unsigned POUT1H:1;
  unsigned POUT2L:1;
  unsigned POUT2H:1;
  unsigned POUT3L:1;
  unsigned POUT3H:1;
  unsigned POUT4L:1;
  unsigned POUT4H:1;
  unsigned POVD1L:1;
  unsigned POVD1H:1;
  unsigned POVD2L:1;
  unsigned POVD2H:1;
  unsigned POVD3L:1;
  unsigned POVD3H:1;
  unsigned POVD4L:1;
  unsigned POVD4H:1;
} P1OVDCONBITS;
extern volatile P1OVDCONBITS P1OVDCONbits __attribute__((__sfr__));

#define P1DC1 P1DC1
extern volatile unsigned int  P1DC1 __attribute__((__sfr__));
#define PDC1 PDC1
extern volatile unsigned int  PDC1 __attribute__((__sfr__));
#define P1DC2 P1DC2
extern volatile unsigned int  P1DC2 __attribute__((__sfr__));
#define PDC2 PDC2
extern volatile unsigned int  PDC2 __attribute__((__sfr__));
#define P1DC3 P1DC3
extern volatile unsigned int  P1DC3 __attribute__((__sfr__));
#define PDC3 PDC3
extern volatile unsigned int  PDC3 __attribute__((__sfr__));
#define P1DC4 P1DC4
extern volatile unsigned int  P1DC4 __attribute__((__sfr__));
#define PDC4 PDC4
extern volatile unsigned int  PDC4 __attribute__((__sfr__));
#define QEI1CON QEI1CON
extern volatile unsigned int  QEI1CON __attribute__((__sfr__));
__extension__ typedef struct tagQEI1CONBITS {
  union {
    struct {
      unsigned UPDN_SRC:1;
      unsigned TQCS:1;
      unsigned POSRES:1;
      unsigned TQCKPS0:1;
      unsigned TQCKPS1:1;
      unsigned TQGATE:1;
      unsigned PCDOUT:1;
      unsigned SWPAB:1;
      unsigned QEIM0:1;
      unsigned QEIM1:1;
      unsigned QEIM2:1;
      unsigned UPDN:1;
      unsigned INDX:1;
      unsigned QEISIDL:1;
      unsigned :1;
      unsigned CNTERR:1;
    };
    struct {
      unsigned :3;
      unsigned TQCKPS:2;
      unsigned :3;
      unsigned QEIM:3;
    };
  };
} QEI1CONBITS;
extern volatile QEI1CONBITS QEI1CONbits __attribute__((__sfr__));

#define QEICON QEICON
extern volatile unsigned int  QEICON __attribute__((__sfr__));
__extension__ typedef struct tagQEICONBITS {
  union {
    struct {
      unsigned UPDN_SRC:1;
      unsigned TQCS:1;
      unsigned POSRES:1;
      unsigned TQCKPS0:1;
      unsigned TQCKPS1:1;
      unsigned TQGATE:1;
      unsigned PCDOUT:1;
      unsigned SWPAB:1;
      unsigned QEIM0:1;
      unsigned QEIM1:1;
      unsigned QEIM2:1;
      unsigned UPDN:1;
      unsigned INDX:1;
      unsigned QEISIDL:1;
      unsigned :1;
      unsigned CNTERR:1;
    };
    struct {
      unsigned :3;
      unsigned TQCKPS:2;
      unsigned :3;
      unsigned QEIM:3;
    };
  };
} QEICONBITS;
extern volatile QEICONBITS QEICONbits __attribute__((__sfr__));

#define DFLT1CON DFLT1CON
extern volatile unsigned int  DFLT1CON __attribute__((__sfr__));
__extension__ typedef struct tagDFLT1CONBITS {
  union {
    struct {
      unsigned :4;
      unsigned QECK0:1;
      unsigned QECK1:1;
      unsigned QECK2:1;
      unsigned QEOUT:1;
      unsigned CEID:1;
      unsigned IMV0:1;
      unsigned IMV1:1;
    };
    struct {
      unsigned :4;
      unsigned QECK:3;
      unsigned :2;
      unsigned IMV:2;
    };
  };
} DFLT1CONBITS;
