Ryan-Rogers/MMSoftware/MM_2015.X/support/dspic33f/h/p33FJ128MC706.h
#define _DTCON1_DTAPS0_POSITION                  0x00000006
#define _DTCON1_DTAPS0_MASK                      0x00000040
#define _DTCON1_DTAPS0_LENGTH                    0x00000001

#define _DTCON1_DTAPS1_POSITION                  0x00000007
#define _DTCON1_DTAPS1_MASK                      0x00000080
#define _DTCON1_DTAPS1_LENGTH                    0x00000001

#define _DTCON1_DTB0_POSITION                    0x00000008
#define _DTCON1_DTB0_MASK                        0x00000100
#define _DTCON1_DTB0_LENGTH                      0x00000001

#define _DTCON1_DTB1_POSITION                    0x00000009
#define _DTCON1_DTB1_MASK                        0x00000200
#define _DTCON1_DTB1_LENGTH                      0x00000001

#define _DTCON1_DTB2_POSITION                    0x0000000A
#define _DTCON1_DTB2_MASK                        0x00000400
#define _DTCON1_DTB2_LENGTH                      0x00000001

#define _DTCON1_DTB3_POSITION                    0x0000000B
#define _DTCON1_DTB3_MASK                        0x00000800
#define _DTCON1_DTB3_LENGTH                      0x00000001

#define _DTCON1_DTB4_POSITION                    0x0000000C
#define _DTCON1_DTB4_MASK                        0x00001000
#define _DTCON1_DTB4_LENGTH                      0x00000001

#define _DTCON1_DTB5_POSITION                    0x0000000D
#define _DTCON1_DTB5_MASK                        0x00002000
#define _DTCON1_DTB5_LENGTH                      0x00000001

#define _DTCON1_DTBPS0_POSITION                  0x0000000E
#define _DTCON1_DTBPS0_MASK                      0x00004000
#define _DTCON1_DTBPS0_LENGTH                    0x00000001

#define _DTCON1_DTBPS1_POSITION                  0x0000000F
#define _DTCON1_DTBPS1_MASK                      0x00008000
#define _DTCON1_DTBPS1_LENGTH                    0x00000001

#define _P1DTCON1_DTA_POSITION                   0x00000000
#define _P1DTCON1_DTA_MASK                       0x0000003F
#define _P1DTCON1_DTA_LENGTH                     0x00000006

#define _P1DTCON1_DTAPS_POSITION                 0x00000006
#define _P1DTCON1_DTAPS_MASK                     0x000000C0
#define _P1DTCON1_DTAPS_LENGTH                   0x00000002

#define _P1DTCON1_DTB_POSITION                   0x00000008
#define _P1DTCON1_DTB_MASK                       0x00003F00
#define _P1DTCON1_DTB_LENGTH                     0x00000006

#define _P1DTCON1_DTBPS_POSITION                 0x0000000E
#define _P1DTCON1_DTBPS_MASK                     0x0000C000
#define _P1DTCON1_DTBPS_LENGTH                   0x00000002

#define _P1DTCON1_DTA0_POSITION                  0x00000000
#define _P1DTCON1_DTA0_MASK                      0x00000001
#define _P1DTCON1_DTA0_LENGTH                    0x00000001

#define _P1DTCON1_DTA1_POSITION                  0x00000001
#define _P1DTCON1_DTA1_MASK                      0x00000002
#define _P1DTCON1_DTA1_LENGTH                    0x00000001

#define _P1DTCON1_DTA2_POSITION                  0x00000002
#define _P1DTCON1_DTA2_MASK                      0x00000004
#define _P1DTCON1_DTA2_LENGTH                    0x00000001

#define _P1DTCON1_DTA3_POSITION                  0x00000003
#define _P1DTCON1_DTA3_MASK                      0x00000008
#define _P1DTCON1_DTA3_LENGTH                    0x00000001

#define _P1DTCON1_DTA4_POSITION                  0x00000004
#define _P1DTCON1_DTA4_MASK                      0x00000010
#define _P1DTCON1_DTA4_LENGTH                    0x00000001

#define _P1DTCON1_DTA5_POSITION                  0x00000005
#define _P1DTCON1_DTA5_MASK                      0x00000020
#define _P1DTCON1_DTA5_LENGTH                    0x00000001

#define _P1DTCON1_DTAPS0_POSITION                0x00000006
#define _P1DTCON1_DTAPS0_MASK                    0x00000040
#define _P1DTCON1_DTAPS0_LENGTH                  0x00000001

#define _P1DTCON1_DTAPS1_POSITION                0x00000007
#define _P1DTCON1_DTAPS1_MASK                    0x00000080
#define _P1DTCON1_DTAPS1_LENGTH                  0x00000001

#define _P1DTCON1_DTB0_POSITION                  0x00000008
#define _P1DTCON1_DTB0_MASK                      0x00000100
#define _P1DTCON1_DTB0_LENGTH                    0x00000001

#define _P1DTCON1_DTB1_POSITION                  0x00000009
#define _P1DTCON1_DTB1_MASK                      0x00000200
#define _P1DTCON1_DTB1_LENGTH                    0x00000001

#define _P1DTCON1_DTB2_POSITION                  0x0000000A
#define _P1DTCON1_DTB2_MASK                      0x00000400
#define _P1DTCON1_DTB2_LENGTH                    0x00000001

#define _P1DTCON1_DTB3_POSITION                  0x0000000B
#define _P1DTCON1_DTB3_MASK                      0x00000800
#define _P1DTCON1_DTB3_LENGTH                    0x00000001

#define _P1DTCON1_DTB4_POSITION                  0x0000000C
#define _P1DTCON1_DTB4_MASK                      0x00001000
#define _P1DTCON1_DTB4_LENGTH                    0x00000001

#define _P1DTCON1_DTB5_POSITION                  0x0000000D
#define _P1DTCON1_DTB5_MASK                      0x00002000
#define _P1DTCON1_DTB5_LENGTH                    0x00000001

#define _P1DTCON1_DTBPS0_POSITION                0x0000000E
#define _P1DTCON1_DTBPS0_MASK                    0x00004000
#define _P1DTCON1_DTBPS0_LENGTH                  0x00000001

#define _P1DTCON1_DTBPS1_POSITION                0x0000000F
#define _P1DTCON1_DTBPS1_MASK                    0x00008000
#define _P1DTCON1_DTBPS1_LENGTH                  0x00000001

#define _DTCON2_DTS1I_POSITION                   0x00000000
#define _DTCON2_DTS1I_MASK                       0x00000001
#define _DTCON2_DTS1I_LENGTH                     0x00000001

#define _DTCON2_DTS1A_POSITION                   0x00000001
#define _DTCON2_DTS1A_MASK                       0x00000002
#define _DTCON2_DTS1A_LENGTH                     0x00000001

#define _DTCON2_DTS2I_POSITION                   0x00000002
#define _DTCON2_DTS2I_MASK                       0x00000004
#define _DTCON2_DTS2I_LENGTH                     0x00000001

#define _DTCON2_DTS2A_POSITION                   0x00000003
#define _DTCON2_DTS2A_MASK                       0x00000008
#define _DTCON2_DTS2A_LENGTH                     0x00000001

